# LengthParameterError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarCouplerFailures..::..LengthParameterError Property
BuiltInFailures..::..RebarCouplerFailures Class See Also
---
This is used to post error. The "Total Length" parameter must be set to a strictly positive value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId LengthParameterError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LengthParameterError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ LengthParameterError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarCouplerFailures Class
Autodesk.Revit.DB Namespace